Revit 2026 API

# BumpmapType Enumeration

---

The enumerated type representing the permitted values for the asset property "BumpmapType" from the "BumpMap" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum BumpmapType
```
```vb
Public Enumeration BumpmapType
```
```cpp
public enum class BumpmapType
```
```fsharp
type BumpmapType
```

| Member name | Value | Description |
| --- | --- | --- |
| HeightMap | 0 |  |
| NormalMap | 1 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace